[
  {
    "title": "current.org",
    "role": "Senior Software Engineer",
    "duration": "(02/2024 - present)",
    "company": {
      "name": "Bounteous x Accolite",
      "website": "https://www.bounteous.com/"
    },
    "responsibilities": [
      "Responsible for bridging the technology gap between stakeholders, solution architect and designers, thus improving lead time.",
      "Responsible for unit testing the developed solutions resulting in controlled code churn.",
      "Responsible for choosing the correct tools and libraries for optimum performance and adherence of industry standard practices.",
      "Collaborated with cross functional team ensuring seamless integration/migration of legacy stack with/to the modern stack."
    ]
  },
  {
    "title": "past.org",
    "role": "Product Engineer",
    "duration": "(09/2023 - 02/2024)",
    "company": {
      "name": "Fitbots OKRs",
      "website": "https://www.fitbots.com/"
    },
    "responsibilities": [
      "Worked on Generative AI and AI prompt engineering to boost product adoption rate.",
      "Enabled streaming of API responses to support streaming in the form of a custom scalable hook.",
      "Implemented a solution to render Markdown API responses in a legible format, utilizing the Markdown library to ensure compliance with React security measures.",
      "Led the seamless migration of the backend system from legacy version to long term support version."
    ]
  },
  {
    "title": "past.org",
    "role": "Full Stack Developer",
    "duration": "(05/2021 - 09/2023)",
    "company": {
      "name": "Specscart",
      "website": "https://specscart.co.uk/"
    },
    "responsibilities": [
      "Built and designed several libraries, to reduce dependence on third-party solutions, resulting in more efficient page load times.",
      "Designed an internal system to track each stage of a product for efficient time management within the warehouse.",
      "Integrated various payment gateways & logistic APIs resulting in higher conversion rates.",
      "Migrated Excel-based tasks to system and implemented chart libraries for enhanced data visualization."
    ]
  }
]
